def 자기소개(introduce):
    for a in range(1,introduce+1):
        print("안녕하세요. 저는 누구누구입니다.")
# 매개변수로 받은 숫자만큼 여러번 인사하는 함수를 만들어주세요. 

# v2
자기소개(10)
# 출력 :  안녕하세요. 저는 누구누구입니다 
#        안녕하세요. 저는 누구누구입니다
#        안녕하세요. 저는 누구누구입니다 
#        안녕하세요. 저는 누구누구입니다 
#        안녕하세요. 저는 누구누구입니다 
#        안녕하세요. 저는 누구누구입니다 
#        안녕하세요. 저는 누구누구입니다 
#        안녕하세요. 저는 누구누구입니다 
#        안녕하세요. 저는 누구누구입니다 
#        안녕하세요. 저는 누구누구입니다 
print("\n\n")
자기소개(5)
# 출력 : 안녕하세요. 저는 누구누구입니다
#        안녕하세요. 저는 누구누구입니다 
#        안녕하세요. 저는 누구누구입니다 
#        안녕하세요. 저는 누구누구입니다 
#        안녕하세요. 저는 누구누구입니다 
print("\n\n")
자기소개(1)
# 출력 : 안녕하세요. 저는 누구누구입니다
